; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 946158 2 2 3 3 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image1 - mode
	spectrograph2 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Planet3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet4)
	(supports instrument1 spectrograph2)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon5)
)
(:goal (and
	(have_image Planet3 spectrograph2)
	(have_image Planet4 spectrograph2)
	(have_image Phenomenon5 spectrograph2)
	(have_image Planet6 spectrograph2)
	(have_image Phenomenon7 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (turn_to satellite0 groundstation2 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 5
4. (turn_to satellite1 planet4 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet4)
   goals met: 0 of 5
5. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 5
6. (turn_to satellite1 planet3 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 planet3)
   goals met: 0 of 5
7. (turn_to satellite0 planet6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet6)
   goals met: 0 of 5
8. (turn_to satellite1 planet4 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 planet4)
   goals met: 0 of 5
9. (take_image satellite0 planet6 instrument0 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 1 of 5
10. (turn_to satellite1 phenomenon7 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 5
11. (turn_to satellite0 planet3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet3)
   goals met: 1 of 5
12. (turn_to satellite1 planet4 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet4)
   goals met: 1 of 5
13. (take_image satellite0 planet3 instrument0 spectrograph2)
   added: (have_image planet3 spectrograph2)
   goals met: 2 of 5
14. (turn_to satellite1 phenomenon5 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 5
15. (turn_to satellite0 phenomenon7 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 5
16. (turn_to satellite1 planet4 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet4)
   goals met: 2 of 5
17. (take_image satellite0 phenomenon7 instrument0 image1)
   added: (have_image phenomenon7 image1)
   goals met: 3 of 5
18. (turn_to satellite1 groundstation1 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 groundstation1)
   goals met: 3 of 5
19. (turn_to satellite0 phenomenon5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 5
20. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 3 of 5
21. (take_image satellite0 phenomenon5 instrument0 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 4 of 5
22. (turn_to satellite1 planet4 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet4)
   goals met: 4 of 5
23. (take_image satellite1 planet4 instrument1 spectrograph2)
   added: (have_image planet4 spectrograph2)
   goals met: 5 of 5
